routes/web.php

select * from `users` where `id` = '3' limit 1
---
//Comments Route
Route::post('/Buyers/{buyers}/comments', 'CommentsController@create_comment');

Route::get('/markAsRead', function(){
  auth()->user()->unreadNotifications->markAsRead();
});