app/Http/Controllers/BidsController.php

    public function createBid(Buyers $buyers)
    {
      $bid = Bids::create([
          'quantity' => 10,
          'user_id' => auth()->id(),
          'demands_id' => $buyers->id
      ]);
---
insert into `bids` (`quantity`, `user_id`, `demands_id`, `updated_at`, `created_at`) values ('10', '2', '67', '2017-08-31 18:48:56', '2017-08-31 18:48:56')