app/Http/Controllers/BuyersController.php

select * from `demands` order by `id` desc limit 5 offset 0
---
    public function index()
    {
        $demands = Buyers::orderBy('id', 'desc')->paginate(5);;
        return view('Buyers.index')->with('demands',$demands);