app/Http/Controllers/CommentsController.php

insert into `comments` (`body`, `user_id`, `buyers_id`, `updated_at`, `created_at`) values ('laskafs', '2', '67', '2017-08-31 14:48:48', '2017-08-31 14:48:48')
---
    public function create_comment(Buyers $buyers)
    {

        Comments::create([
            'body' => request('body'),
            'user_id' => auth()->id(),
            'buyers_id' => $buyers->id
        ]);